IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G1_EPWM4_CONTROLSS_G1_EPWM4.xml
	<register id="CONTROLSS_G1_EPWM4_ETFLG" acronym="CONTROLSS_G1_EPWM4_ETFLG" offset="0x150" width="16" description="Event Trigger Flag Register">
		<bitfield id="SOCB" width="1" begin="3" end="3" resetval="0x0" description="Latched ePWM ADC Start-of-Conversion A [EPWMxSOCB] Status Flag  Unlike the ETFLG[INT] flag, the EPWMxSOCB output will continue to pulse even if the flag bit is set.   0: Indicates no event occurred  1: Indicates that a start of conversion pulse was generated on EPWMxSOCB. The EPWMxSOCB output will continue to be generated even if the flag bit is set." range="3" rwaccess="R"/> 
		<bitfield id="SOCA" width="1" begin="2" end="2" resetval="0x0" description="Latched ePWM ADC Start-of-Conversion A [EPWMxSOCA] Status Flag  Unlike the ETFLG[INT] flag, the EPWMxSOCA output will continue to pulse even if the flag bit is set.   0: Indicates no event occurred  1: Indicates that a start of conversion pulse was generated on EPWMxSOCA. The EPWMxSOCA output will continue to be generated even if the flag bit is set." range="2" rwaccess="R"/> 
		<bitfield id="INT" width="1" begin="0" end="0" resetval="0x0" description="Latched ePWM Interrupt [EPWMx_INT] Status Flag   0: Indicates no event occurred  1: Indicates that an ePWMx interrupt [EPWMx_INT] was generated. No further interrupts will be generated until the flag bit is cleared. Up to one interrupt can be pending while the ETFLG[INT] bit is still set. If an interrupt is pending, it will not be generated until after the ETFLG[INT] bit is cleared." range="0" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G1_EPWM4_ETCLR" acronym="CONTROLSS_G1_EPWM4_ETCLR" offset="0x154" width="16" description="Event Trigger Clear Register">
		<bitfield id="SOCB" width="1" begin="3" end="3" resetval="0x0" description="ePWM ADC Start-of-Conversion A [EPWMxSOCB] Flag Clear Bit   0: Writing a 0 has no effect. Always reads back a 0  1: Clears the ETFLG[SOCB] flag bit" range="3" rwaccess="R/W1TS"/> 
		<bitfield id="SOCA" width="1" begin="2" end="2" resetval="0x0" description="ePWM ADC Start-of-Conversion A [EPWMxSOCA] Flag Clear Bit   0: Writing a 0 has no effect. Always reads back a 0  1: Clears the ETFLG[SOCA] flag bit" range="2" rwaccess="R/W1TS"/> 
		<bitfield id="INT" width="1" begin="0" end="0" resetval="0x0" description="ePWM Interrupt [EPWMx_INT] Flag Clear Bit   0: Writing a 0 has no effect. Always reads back a 0  1: Clears the ETFLG[INT] flag bit and enable further interrupts pulses to be generated" range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="CONTROLSS_G1_EPWM4_ETFRC" acronym="CONTROLSS_G1_EPWM4_ETFRC" offset="0x158" width="16" description="Event Trigger Force Register">
		<bitfield id="SOCB" width="1" begin="3" end="3" resetval="0x0" description="SOCB Force Bit  The SOCB pulse will only be generated if the event is enabled in the ETSEL register. The ETFLG[SOCB] flag bit will be set regardless.   0: Writing 0 to this bit will be ignored. Always reads back a 0.  1: Generates a pulse on EPWMxSOCB and set the SOCBFLG bit. This bit is used for test purposes." range="3" rwaccess="R/W1TS"/> 
		<bitfield id="SOCA" width="1" begin="2" end="2" resetval="0x0" description="SOCA Force Bit  The SOCA pulse will only be generated if the event is enabled in the ETSEL register. The ETFLG[SOCA] flag bit will be set regardless.   0: Writing 0 to this bit will be ignored. Always reads back a 0.  1: Generates a pulse on EPWMxSOCA and set the SOCAFLG bit. This bit is used for test purposes." range="2" rwaccess="R/W1TS"/> 
		<bitfield id="INT" width="1" begin="0" end="0" resetval="0x0" description="INT Force Bit  The interrupt will only be generated if the event is enabled in the ETSEL register. The INT flag bit will be set regardless.   0: Writing 0 to this bit will be ignored. Always reads back a 0.  1: Generates an interrupt on EPWMxINT and set the INT flag bit. This bit is used for test purposes." range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="CONTROLSS_G1_EPWM4_ETINTPS" acronym="CONTROLSS_G1_EPWM4_ETINTPS" offset="0x15C" width="16" description="Event-Trigger Interrupt Pre-Scale Register">
		<bitfield id="INTCNT2" width="4" begin="7" end="4" resetval="0x0" description="EPWMxINT Counter 2  When ETPS[INTPSSEL]=1, these bits indicate how many selected events have occurred:   0000: No events  0001: 1 event  0010: 2 events  0011: 3 events  0100: 4 events  ...  1111: 15 events" range="7 - 4" rwaccess="R"/> 
		<bitfield id="INTPRD2" width="4" begin="3" end="0" resetval="0x0" description="EPWMxINT Period 2 Select  When ETPS[INTPSSEL] = 1, these bits select how many selected events need to occur before an interrupt is generated:   0000: Disable counter  0001: Generate interrupt on INTCNT = 1 [first event]  0010: Generate interrupt on INTCNT = 2 [second event]  0011: Generate interrupt on INTCNT = 3 [third event]  0100: Generate interrupt on INTCNT = 4 [fourth event]  ...  1111: Generate interrupt on INTCNT = 15 [fifteenth event]" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM4_ETSOCPS" acronym="CONTROLSS_G1_EPWM4_ETSOCPS" offset="0x160" width="16" description="Event-Trigger SOC Pre-Scale Register">
		<bitfield id="SOCBCNT2" width="4" begin="15" end="12" resetval="0x0" description="EPWMxSOCB Counter 2  When ETPS[SOCPSSEL] = 1, these bits indicate how many selected events have occurred:   0000: No events  0001: 1 event  0010: 2 events  0011: 3 events  0100: 4 events  ...  1111: 15 events" range="15 - 12" rwaccess="R"/> 
		<bitfield id="SOCBPRD2" width="4" begin="11" end="8" resetval="0x0" description="EPWMxSOCB Period 2 Select  When ETPS[SOCPSSEL] = 1, these bits select how many selected event need to occur before an SOCB pulse is generated:   0000: Disable counter  0001: Generate interrupt on SOCBCNT2 = 1 [first event]  0010: Generate interrupt on SOCBCNT2 = 2 [second event]  0011: Generate interrupt on SOCBCNT2 = 3 [third event]  0100: Generate interrupt on SOCBCNT2 = 4 [fourth event]  ...  1111: Generate interrupt on SOCBCNT2 = 15 [fifteenth event]" range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="SOCACNT2" width="4" begin="7" end="4" resetval="0x0" description="EPWMxSOCA Counter 2  When ETPS[SOCPSSEL] = 1, these bits indicate how many selected events have occurred:   0000: No events  0001: 1 event  0010: 2 events  0011: 3 events  0100: 4 events  ...  1111: 15 events" range="7 - 4" rwaccess="R"/> 
		<bitfield id="SOCAPRD2" width="4" begin="3" end="0" resetval="0x0" description="EPWMxSOCA Period 2 Select  When ETPS[SOCPSSEL] = 1, these bits select how many selected event need to occur before an SOCA pulse is generated:   0000: Disable counter  0001: Generate interrupt on SOCACNT2 = 1 [first event]  0010: Generate interrupt on SOCACNT2 = 2 [second event]  0011: Generate interrupt on SOCACNT2 = 3 [third event]  0100: Generate interrupt on SOCACNT2 = 4 [fourth event]  ...  1111: Generate interrupt on SOCACNT2 = 15 [fifteenth event]" range="3 - 0" rwaccess="R/W"/>
	</register>
